[
    {
      "listingLink": "https://www.zillow.com/homedetails/45672-Jaguar-Way-Temecula-CA-92592/69268074_zpid/",
      "address": "45672 Jaguar Way, Temecula, CA 92592",
      "price": "$470,900",
      "bedrooms": "3",
      "baths": "2",
      "houseSize": "2,141",
      "year": "2005",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "6,098 sqft",
      "listingAgent": "JUSTIN TYE / ACTIVE REALTY",
      "brokerage": "Active Realty",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS6ui0ugsv1fbv1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISeob5zs8xe3gx0000000000.jpg",
      "details": "Rare single story property in the Wolf Creek community with open floor plan, formal living and dining rooms, spacious kitchen with large center island, and plenty of cabinet space. Kitchen opens to family room which features an inviting fireplace. Master suite offers walk-in closet and master bath with separate shower and tub and dual sinks. Carpet and laminate wood flooring throughout. Nearby park, close to shopping, casual and fine dining.  Easy access to freeway."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/32155-Corte-Carmela-Temecula-CA-92592/18187595_zpid/",
      "address": "32155 Corte Carmela, Temecula, CA 92592",
      "price": "$539,900",
      "bedrooms": "4",
      "baths": "3",
      "houseSize": "2,595",
      "year": "1998",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "7,840 sqft",
      "listingAgent": "Robert Kravetz",
      "brokerage": "Realty ONE Group West",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISq9000r7v54ws1000000000.jpg",
      "agentImage": "https://www.zillowstatic.com/static/images/nophoto_h_n.png",
      "details": "***WELCOME TO THE VINTAGE HILLS COMMUNITY OF TEMECULA***THIS GORGEOUS POOL HOME IS LOCATED ON A DOUBLE CUL-DE-SAC***OPEN & SPACIOUS 4 BEDROOM (DOWNSTAIRS BEDROOM CONVERTED INTO AN OFFICE) 3 BATH & BONUS ROOM***UPON ENTERING THIS WONDERFUL HOME YOU WILL NOTICE ALL OF THE LIGHT THAT COMES THROUGH THE MANY PICTURESQUE WINDOWS GIVING THE LIVING ROOM & DINING ROOM AN OPEN AIRY FEELING***THIS HOME IS HIGHLY UPGRADED WITH LARGE TILE FLOORING & RECENTLY UPGRADED CARPETING THROUGHOUT***THE BEAUTIFUL ISLAND KITCHEN FEATURES ANTIQUE WHITE CABINETS WITH BLACK GRANITE COUNTER TOPS & STAINLESS APPLIANCES***CROWN MOLDING THROUGHOUT THE KITCHEN, FAMILY ROOM, BONUS ROOM & OFFICE***JUST OFF THE KITCHEN IS THE FAMILY ROOM FEATURING A BEAUTIFUL STONE FIREPLACE***UPSTAIRS FEATURES THE MASTER BEDROOM & MASTER BATH WITH LARGE WALK IN CLOSET***OFF THE MASTER SUITE IS A BEAUTIFUL BALCONY OVERLOOKING THE SPARKLING POOL & COMMUNITY BELOW***THERE ARE 2 ADDITIONAL LARGE BEDROOMS WITH A JACK & JILL DOUBLE SINK BATHROOM BETWEEN THEM***THE BACKYARD IS AN ENTERTAINERS PARADISE***IT FEATURES A BEAUTIFUL POOL & SPA ALONG WITH A LARGE PATIO WITH BUILT IN BBQ & FIRE PIT***THIS VINTAGE HILLS COMMUNITY FEATURES RESORT LIKE AMENITIES***POOLS, TOT LOTS, BASEBALL DIAMOND, SPORTS COURTS & CLUBHOUSE***WITH LOW MONTHLY HOA & LOW SPECIAL ASSESSMENTS***YOU ARE CONVENIENTLY LOCATED WITHIN MINUTES FROM SHOPPING, DINING, SCHOOLS, & AWARD WINNING TEMECULA WINERIES***A GREAT OPPORTUNITY TO LIVE IN A TERRIFIC NEIGHBORHOOD!!!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/40332-Chantemar-Way-Temecula-CA-92591/52475986_zpid/",
      "address": "40332 Chantemar Way, Temecula, CA 92591",
      "price": "$519,000",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "2,427",
      "year": "2001",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "6,098 sqft",
      "listingAgent": "The Huff Team",
      "brokerage": "Pacific Sotheby's International Realty",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS6ydzsssqnmth1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISyvijbryjmznw1000000000.jpg",
      "details": "Located in the heart of Temecula Wine Country in the desirable neighborhood of Chantamar Estates Villas! Truly an entertainer's paradise offering an expansive and private backyard with no neighbors behind, sparkling pool with slide and spa, built-in BBQ, covered patio, game room, and relaxing balcony to enjoy stunning sunsets and mountain views! Highlights include stylish modern upgrades throughout, solar energy system, custom paint, wood-like floors, open concept kitchen with granite counters and oversized eat-in center island overlooking family room, spacious master suite with spa-like bathroom and balcony overlooking mountains, entry level bedroom with bathroom, backyard paradise and so much more!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/40308-Odessa-Dr-Temecula-CA-92591/52476102_zpid/",
      "address": "40308 Odessa Dr, Temecula, CA 92591",
      "price": "$994,900",
      "bedrooms": "6",
      "baths": "5",
      "houseSize": "4,941",
      "year": "2001",
      "heating": "Forced air, Other",
      "cooling": "Central",
      "lotSize": "0.46 acres",
      "listingAgent": "Louie Zember - Zember Realty Group",
      "brokerage": "Zember Realty Group",
      "houseImage": "https://photos.zillowstatic.com/fp/4158b21e5045d9ffb1e427f3d7b2f257-p_h.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISyz9jwpq6btvq1000000000.jpg",
      "details": "LOCATION, GUEST HOUSE, POOL & SPA ... This stunning Chante mar Estate home sits on a 1/2 acre of lush landscaping in one of the most desired neighborhoods in Temecula. The main house boasts an open floor plan with 5 bedrooms & 4 bathrooms while the detached guest house has 1 bedroom & 1 bathroom. This upgraded home includes travertine floors, new carpet, wood tile flooring upstairs, plantation shutters, whole house fan, a downstairs bedroom w/ end-suite bathroom, large bedrooms, and a loft.  The open concept kitchen includes granite counters, stainless steel appliances, dual ovens, plenty of storage space, a large island, and a separate breakfast nook. The master suite includes a large bedroom with retreat and a fireplace. The spacious master bath includes a large soaking tub and separate shower, dual walk-in closets with one of the closets built as a safe room (with steel lined interior walls and a steel door). If you enjoy spending time outdoors this backyard is for you. The backyard is complete with a large pebble-Tec pool & spa with a rock water slide & waterfall. The backyard also has a great entertaining area complete with an outdoor kitchen, fireplace, & fire pit. Have kids...this yard is also complete with a custom built playhouse.  Need a large garage...this home has an attached 840 sq. Ft. garage!! Looking for a home with tons of amenities in a prime location with No HOA and Low Taxes...Look no further...you have found it."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/31345-Ashmill-Ct-Temecula-CA-92591/18191703_zpid/",
      "address": "31345 Ashmill Ct, Temecula, CA 92591",
      "price": "$475,000",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "2,351",
      "year": "1988",
      "heating": "Gas",
      "cooling": "Central",
      "lotSize": "10,018 sqft",
      "listingAgent": "James Monks",
      "brokerage": "Windermere Tower Properties",
      "houseImage": "https://photos.zillowstatic.com/fp/8489226b4d2fc6517b7b48d6854d0f7f-p_h.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISybrgjrxrs68y0000000000.jpg",
      "details": "Resort style pool home with spa, waterslide, waterfall, and firepit.  Newer roof, windows, and paint.  Remodeled kitchen, updated bathrooms, and much more. Prime location within a quiet cul-de-sac in this desirable Temecula neighborhood with low taxes and no HOA.  One bedroom downstairs (currently used as an office).  Large formal living room, spacious family room with fireplace, and nicely updated kitchen.  Outdoor kitchen, covered patio, and $100,000+ custom rock saltwater pool with steps leading to elevated seating area with unobstructed views.  Three car garage has a single car door at the rear of the garage that could be ideal for storing additional toys or simply using as a pull through to detail your car, motorcycle, etc while you enjoy the sights and sounds of the three separate waterfalls within the pool.  Spacious master suite with expansive walk-in closet.  Large guest bedrooms upstairs.  Large laundry room just off the garage with ample cabinet space and convenient side door leading toward the pool.  Low maintenance, drought tolerant landscape in the rear yard."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/45277-Aguila-Ct-Temecula-CA-92592/54968894_zpid/",
      "address": "45277 Aguila Ct, Temecula, CA 92592",
      "price": "$489,999",
      "bedrooms": "4",
      "baths": "3",
      "houseSize": "2,668",
      "year": "2001",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "4,791 sqft",
      "listingAgent": "Mary Barney",
      "brokerage": "CENTURY 21 Wright",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS6ip5xv5wh6df0000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISew5qhnfqk5lz0000000000.jpg",
      "details": "Lovely Redhawk pool and spa home on a cul-de-sac street, and with no rear neighbors, it has the WOW factor! Low maintenance yard with 3 hole artificial turf putting green, and inviting swimming pool and spa in the backyard! No HOA! Beautiful darker laminate wood flooring is throughout most of the downstairs giving this home a warm & inviting feel. A great open layout includes a downstairs bedroom and bathroom. Beautiful white cabinets are offset by solid surface counters in the kitchen, an eat at island w/ room for barstool seating and walk in pantry. Adjacent is a large great room open to the kitchen w/fireplace and ceiling fan. Master bathroom has dual mirrored  closets, one a walk in closet, separate sinks and vanity area, tile flooring & a separate soaking tub & shower. The two additional bedrooms upstairs feature walk in closets and a Jack and Jill bathroom! Additionally the upstairs features a built in desk area with cabinetry and open loft area with book case.  Enjoy the beautiful Temecula days & evenings in your backyard with no rear neighbors, while enjoying your lovely pool and spa. Located in the boundaries of excellent South Temecula schools, Redhawk golf course & Temecula's  Wine Country! This truly is a home you can't miss and it can be yours just in time for Summer!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/39749-Rustic-Glen-Dr-Temecula-CA-92591/54966069_zpid/",
      "address": "39749 Rustic Glen Dr, Temecula, CA 92591",
      "price": "$349,999",
      "bedrooms": "3",
      "baths": "2",
      "houseSize": "1,383",
      "year": "1989",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "6,534 sqft",
      "listingAgent": "Jim Bottrell Team GUARANTEED Home Sale",
      "brokerage": "Ardent Real Estate Services",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISm6jx23b504dd1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISecejapavnunh0000000000.jpg",
      "details": "***For details and showings call (760) 533-0532. Agents - call the listing coordinator at (760) 566-8190 to coordinate showings.***\n\n*************************************************\nFor current pricing, private viewings of this property or insider property detail reports on ANY home you see for sale in the area directly call the Listing Agent on the right side of the screen.\n**************************************************\nSpectacular family home with HUGE private backyard! NO HOA! Walk in and you are instantly greeted by high vaulted ceilings and  tile flooring. Big windows make the home airy and bright. The kitchen displays white cabinets and tons of cabinets in the dining area for never ending storage possibilities. The home has beautiful wood floors on the second floor and a big open space with built in storage and a desk area. The bedrooms are large and bright with high ceilings and closets. Outside, the beautiful home has trees that provide ultimate shade and a large grassy area. A little shed is off to the side for storage along with garden beds. Located down the street from elementary schools, parks, and a Harveston Lake! Seller to entertain offers from $349,999 -$379,999. \n**************************************************"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/45525-Bison-Ct-Temecula-CA-92592/69222638_zpid/",
      "address": "45525 Bison Ct, Temecula, CA 92592",
      "price": "$564,900",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "3,210",
      "year": "2005",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "6,534 sqft",
      "listingAgent": "Kim Meeker",
      "brokerage": "Realty ONE Group Southwest",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISifryat6ijnk51000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/IS6602wwnc0ao11000000000.jpg",
      "details": "Say good bye to high electric bills and hello SOLAR living! Be the first to view this magnificent POOL home located in Wolf Creek. 5 bedrooms, 3 full baths, 3 car garage, POOL/SPA, custom decramolding, cornice boards over windows, crown molding, upgraded baseboards, travertine tile flooring in the family room, chef's kitchen with granite counter tops, custom eat-in breakfast table, newer kitchen-aid cook top and dishwasher, double ovens, pull out shelving in cabinets & walk in pantry. Reverse osmosis water system in the kitchen, water softener & high end tankless water heater. Built-in media niche with wine rack & touch lighting in the dinning room.  Spacious family room with built-in media niche and gas fireplace. Main floor bedroom and full bath. Second floor laundry room and utility sink. Master suite and master bath includes inviting garden tub, his and her separate vanity and closets with built-in custom shelving. Showroom 2 car garage with epoxy floors, custom showroom lighting, and premium high end built-in cabinets. Separate 3 car garage has built in storage. Relax in your private pool & spa & enjoy making delicious smores by the gas fire pit.  Two whole house fans! Located in South Temecula and walking distance to awards schools including Great Oak high school. Enjoy beautiful golf courses, shopping & Temecula wineries. This home has many upgrades. Come and take a tour today you won't be disappointed. Please view our video for more photos!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/44735-Cupa-Ln-Temecula-CA-92592/18194361_zpid/",
      "address": "44735 Cupa Ln, Temecula, CA 92592",
      "price": "$489,000",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "2,371",
      "year": "1997",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "8,276 sqft",
      "listingAgent": "Cynthia Schlosser",
      "brokerage": "HomeSmart Realty West",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISy7w9uhzcxo7h1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISap1nlwm8jydg0000000000.jpg",
      "details": "Beautiful home in Vail Ranch Short distance to Community Park and elementary school, park is only 2 houses away  Corian kitchen counters, stainless steel appliances, Bosch dishwasher, culdesac location.  No house directly behind, awesome backyard Gazebo for entertaining. One bedroom and bath downstairs, Large bonus room upstairs. 3 car garage, very nice drive up appeal. 2 year old air conditioner, ceiling fans. Beautiful front porch to watch sunsets. Well maintained home come and see!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/34093-Turtle-Creek-St-Temecula-CA-92592/64701964_zpid/",
      "address": "34093 Turtle Creek St, Temecula, CA 92592",
      "price": "$689,990",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "3,335",
      "year": "2005",
      "heating": "Gas, Solar",
      "cooling": "No Data",
      "lotSize": "0.29 acres",
      "listingAgent": "Michelle Bean",
      "brokerage": "First Team Real Estate, Tem",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISukbnvlf66krc1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/IS-1jsi5fb7z5p3x.jpg",
      "details": "BEAUTIFULLY UPGRADED POOL HOME with VIEW - 5bed, 3 Bath, 3 car Tandem (Full Bed/Bath downstairs) on quiet CUL DE SAC in TEMECULA CREEK Community.  UPGRADES GALORE!! INTERIOR: Fresh New Paint, Kitchen Upgrade includes Custom ANTIQUED (distressed) LIGHT GRAY CABINETRY, FARM HOUSE Sink, Large Island, QUARTZ Counters, Stainless Steel Appliances, WOOD TILE FLOORING, WAINSCOTING, CUSTOM BUILT-INS, BARN DOOR, COFFERED CEILINGS, 2 Fireplaces, Tech Desk, LARGE BONUS Room/Closet, Plantation Shutters, Plush CARPETING, Whole House Fan.  Upstairs has LARGE MASTER/RETREAT, Custom Tiled Master Bath, Dual Shower heads/Rain Shower, Jetted Spa Tub, 3 additional bedrooms, bathroom & laundry room upstairs. EXTERIOR: Fresh New Paint, LARGE PRIVATE BACKYARD with VIEW, CUSTOM POOL/SPA, FIRE PIT (gas), Professional grade Basketball Hoop, In Ground Trampoline, Patio Cover, Gated Side Yard (gas/electric hookups for custom BBQ) SOLAR electricity and POOL SOLAR, tankless water heater.  Extremely LOW PROP TAXES... GREAT SCHOOLS - Tony Tobin Elem, Vail Ranch Middle, AWARD Winning Great Oak High School Boundaries... ALL the Best Temecula has to Offer - Close to 15 Freeway, Schools, Parks, Shopping, Restaurants and Old Town Temecula/Wineries."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/31438-Corte-Tunas-Temecula-CA-92592/18186646_zpid/",
      "address": "31438 Corte Tunas, Temecula, CA 92592",
      "price": "$489,000",
      "bedrooms": "4",
      "baths": "2",
      "houseSize": "2,160",
      "year": "1990",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "9,147 sqft",
      "listingAgent": "Don Dowe",
      "brokerage": "3D Realty",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS2bpppmab7c7a0000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISdc22pvf4x82v1000000000.jpg",
      "details": "Custom tile flooring thru-out most of the house with the bedrooms having all new carpet. All new interior paint in warm neutral colors! Black appliances, granite counter tops and vaulted ceilings! The private backyard with Alumawood patio cover and peace and quiet! The double door entry to the den/office/ 4th bedroom leads to the secondary bedrooms and just off the 3 car garage! This unique lot offers a huge front yard and parking in the driveway for additional cars. The master suite has custom tile work in the shower, one of a kind! A wet bar with sink is an awesome plus in the front room, perfect for a pool table of social gatherings. The kitchen overlooks the main family room with gas fireplace, great for entertaining."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/31976-Avenida-Mallari-Temecula-CA-92591/61286757_zpid/",
      "address": "31976 Avenida Mallari, Temecula, CA 92591",
      "price": "$739,900",
      "bedrooms": "4",
      "baths": "4",
      "houseSize": "3,457",
      "year": "2003",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "0.45 acres",
      "listingAgent": "Emily Schuyler",
      "brokerage": "HOMESMART",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS6i13byqwetd00000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISvqe06c6fu6cj.jpg",
      "details": "If you love to entertain, all I have to say is \"Welcome Home.\"  With so much privacy it feels like your own estate.  This large home features a gourmet kitchen complete with large island and granite counter tops.  Large living room, large family room, a room with full private bathroom downstairs, Jack and Jill bedrooms upstairs. Huge master bedroom and remodeled master bath with large walk in closet with new built ins.  Master bedroom features an oversized private balcony great for overseeing your resort-style backyard.  This amazing yard includes freeform pool with slide, spa, fire pit, palapa, large covered patio, playground, built in bbq and so much room to roam. This property offers new paint, new carpet, and refinished hardwood floors.  Huge laundry room, a two car and single car garage, potential for RV or Boat parking and a long private driveway you really must come & see.  This one it will not last as it has everything you could ask for! Agent is owner."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/42356-Masquaz-Ct-Temecula-CA-92592/18166976_zpid/",
      "address": "42356 Masquaz Ct, Temecula, CA 92592",
      "price": "$389,999",
      "bedrooms": "3",
      "baths": "3",
      "houseSize": "1,279",
      "year": "1987",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "5,662 sqft",
      "listingAgent": "Carlos lupercio",
      "brokerage": "AMBIANCE REALTY",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISme1hw39x6hnm0000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISqhmqtzmu63oh1000000000.jpg",
      "details": "HUGE PRICE REDUCTION! This Home Is Located In an Amazing area of a Cul-de-Sac with NO HOA With top Rated schools 9 & 10 Ratings! This Home Offers 3 Bedrooms and 3 Bathroom vaulted Ceilings and a 2 car attached garage.  New Beautiful Upgraded Tile Flooring and Fresh Paint throughout the Home. The owner just Got  Brand New Carpet Through out the Home. Spacious master bedroom with a walk-in closet and other rooms are Good Size Rooms. Huge size backyard with concrete for Low maintenance with enough room to build a pool, playground or have dogs to run around! Situated close to the freeway, shopping, Temecula's award-winning schools; Temecula's winery, & Pechanga Casino is Really close By Very Central to everything! This is A Must See."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/33454-Manchester-Rd-Temecula-CA-92592/59405056_zpid/",
      "address": "33454 Manchester Rd, Temecula, CA 92592",
      "price": "$498,000",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "3,717",
      "year": "2003",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "6,098 sqft",
      "listingAgent": "zhenwei fu",
      "brokerage": "ReMax 2000 Realty",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISesy5ahlzjfw01000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISma6qzaz92yjd0000000000.jpg",
      "details": "Seller is motivated. Well-maintained home located in desirable area of Temecula. Euro-Mediterranean style inside and out welcomes you the moment you step through the front door. The Downstairs is ideal if you have kids who need space!; there are three good-sized bedrooms, a long hall work area, 2nd living room and an office with French doors leading out to a charming wading pool with water features. Good size backyard is perfect for family party. Best of all about this home has (owned) Solar system will help you save a lot of money! don't miss this nice house!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/45566-Hawk-Ct-Temecula-CA-92592/69278729_zpid/",
      "address": "45566 Hawk Ct, Temecula, CA 92592",
      "price": "$459,000",
      "bedrooms": "4",
      "baths": "4",
      "houseSize": "2,632",
      "year": "2005",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "5,227 sqft",
      "listingAgent": "Mike Stone",
      "brokerage": "HomeSmart Realty West",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISat8rgm3pbhvh1000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/IS2zjh62nm0mt10000000000.jpg",
      "details": "Beautiful 4 Bedroom, 4 Bath, Craftsman Style Home, in the much sought after community of Wolf Creek. Impressive Vaulted Ceilings greet you as you enter. Large Separate Formal Dining Rm. Huge Family Rm, open to the expansive Kitchen Area. 3 of the four bedrooms have their own attached full bathrooms! There is one Bedroom, and Bath Downstairs. Great for company. Beautiful granite counters in the kitchen, with center island, and tons of cabinets for storage. A Must See!!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/43071-Noble-Ct-Temecula-CA-92592/52476733_zpid/",
      "address": "43071 Noble Ct, Temecula, CA 92592",
      "price": "$459,900",
      "bedrooms": "3",
      "baths": "2",
      "houseSize": "1,835",
      "year": "2000",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "7,405 sqft",
      "listingAgent": "Val Ives",
      "brokerage": "Big Block Realty",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISiroclcpyo06x0000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/IS66ootodqlti80000000000.jpg",
      "details": "Welcome home to this very inviting and incredible single story in the sought after area of Crowne Hill bordering Temecula Wine Country. Lush grass and fresh mulch add to the appealing curb appeal along with a covered entry. Located on a quiet cul-de-sac, this home has 3 bedrooms + an office (can be converted into 4th bedroom with closet addition). Neutral carpet and tile throughout. A formal living and dining room area are the perfect space to entertain, the dining offers a China hutch niche and beautiful chandelier. Relax at the back of the home in the family room by the fireplace while visiting with those in the adjacent kitchen. Kitchen luxuries include stainless steel appliances (except dishwasher), island with barstool seating, pendant and recessed lighting, dark rich cabinetry, and an eating area. Secondary bedrooms have mirrored closets and easy access to a full bathroom. Unwind in your master suite that includes a private bathroom with separate tub and shower, dual sinks, a walk-in closet, ceiling fan and access to the backyard. A pool-sized yard awaits with plenty of room for whatever your heart desires. In the boundaries of excellent schools, walk to Crowne Hill Elementary and parks. Close drive to shopping, restaurants, Temecula Hospital, banks, Pechanga Resort & Casino and all that Temecula has to offer. Don't let this one slip by, come see it for yourself! (Backyard photo enhanced.  Grass has recently been reseeded.)"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/31341-Pahuta-St-Temecula-CA-92592/18167311_zpid/",
      "address": "31341 Pahuta St, Temecula, CA 92592",
      "price": "$419,900",
      "bedrooms": "4",
      "baths": "2",
      "houseSize": "2,142",
      "year": "1988",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "7,405 sqft",
      "listingAgent": "Brandon Breshears",
      "brokerage": "Brandon Breshears",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISmud9v0lefp470000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISap1bw0ctiane0000000000.jpg",
      "details": "***BACK ON MARKET - BUYER COULD NOT PERFORM*** LARGEST SINGLE LEVEL HOME IN THE NEIGHBORHOOD WITH 3 CAR GARAGE.  This home has been well maintained by the owner since their purchase in 2005.  Large family room and dining room which leads to a spacious kitchen with breakfast nook.  The kitchen overlooks a 2nd living/family room with a wet bar and fireplace, perfect for entertaining guests or watching the kids play while preparing a meal!  The master bedroom can easily fit a California king bed set and still have more than enough room for a nice sitting area.  En suite in master bedroom has a double vanity, soaking tub, separate shower, private toilet, and walk-in closet. The master also has direct access to the backyard via french doors.  Bedrooms #2 & #3 are both good size with plantation shutters; the optional 4th bedroom can serve as an office or guestroom.  The 2nd bathroom in the home also has a double vanity with tub/shower enclosure and plenty of storage for linens.  Before entering the large 3 car garage, you have a spacious mud room with washer/dryer hook-ups, wash sink, and extra storage.  Finally, the backyard includes a full length lattice, professionally landscaped trees/shrubs/flowers/grass, and gazebo with in-ground spa (pump needs repair).  The backyard is perfect for weekend BBQ's with friends and family while the kids play. Mild cigarette smoke smell in the house - easily fixed with carpet cleaning! The home has been PRICED TO SELL, THIS ONE WON'T LAST!"
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/32891-Valentino-Way-Temecula-CA-92592/18194683_zpid/",
      "address": "32891 Valentino Way, Temecula, CA 92592",
      "price": "$599,950",
      "bedrooms": "4",
      "baths": "4",
      "houseSize": "3,300",
      "year": "1995",
      "heating": "Other",
      "cooling": "Central",
      "lotSize": "6,969 sqft",
      "listingAgent": "Wendy Johnson",
      "brokerage": "CENTURY 21 Preferred",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS2fca8ajcws4i0000000000.jpg",
      "agentImage": "https://photos.zillowstatic.com/h_n/ISd0x92nz5qmwc0000000000.jpg",
      "details": "Perfect home for the pickiest of buyers! Best Temecula Schools! 4 bedroom 4 bath home, to include 3 master suites with private full bath. 1 bedroom and full bath downstairs. Large family room. Newly painted kitchen cabinets. Sunken living room and family room, looks out to pool and meadow with no one behind. Pool with built in table/umbrella and spa, hardscape, covered patio and low maintenance turf. Great curb appeal with custom front walk. Large over size 3 car garage. Access door to laundry and bathroom from pool."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/27343-Quincy-Ln-Temecula-CA-92591/79486262_zpid/",
      "address": "27343 Quincy Ln, Temecula, CA 92591",
      "price": "$529,000",
      "bedrooms": "5",
      "baths": "3",
      "houseSize": "2,434",
      "year": "2007",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "5,227 sqft",
      "listingAgent": "Cheryl Thomason",
      "brokerage": "RE360, Inc",
      "houseImage": "https://photos.zillowstatic.com/p_h/ISugwsacrbctqa0000000000.jpg",
      "agentImage": "https://www.zillowstatic.com/static/images/nophoto_h_n.png",
      "details": "Pool Home with upgrades in the Harveston Lake Community, one of the most sought after neighborhoods in Temecula.  Great pride in ownership. This home is a home owner's delight!! This home has an open floor concept with a remodeled kitchen with two-tone cabinets and apron farm sink in a custom built island. Recessed can lights, Plantation Shutters and Crown moulding throughout.  Downstairs features wood design tile flooring and upstairs has Smart Strand Carpet with memory foam carpet padding. 5 bedroom, 3 full bathrooms with a custom built-in Entertainment center in the Living Room. The home includes a Bosch Dishwasher and GE appliances. Ducting, Air conditioner, dual zones, furnace, and attic insulation replaced in 2014. There is a whole house Quiet Cool attic fan and a Pelican Water Softener and Purifier.  Garage was updated with paint, epoxy floors and overhead storage racks.   Walk outside and enjoy your new backyard with a Salt Water Pool and Spa, both heatable. Built in BBQ island with gazebo, and outdoor gas fire pit.  If that is not enough you have full access to the Lakehouse, Association Pool/Spa and Splash Park, Playgrounds, and Sports Park.   Located near highly desirable Award-Winning Schools, shopping at the Temecula Promenade Mall, Wineries, Pechanga Casino and easy access to both 15 and 215 freeways."
    },
    {
      "listingLink": "https://www.zillow.com/homedetails/43805-Corte-Amaya-Temecula-CA-92592/18189173_zpid/",
      "address": "43805 Corte Amaya, Temecula, CA 92592",
      "price": "$400,000",
      "bedrooms": "3",
      "baths": "3",
      "houseSize": "1,657",
      "year": "1994",
      "heating": "Forced air",
      "cooling": "Central",
      "lotSize": "5,662 sqft",
      "listingAgent": "KRISTIN SCHLANSKY",
      "brokerage": "CALIFORNIA REALTY GROUP INC.",
      "houseImage": "https://photos.zillowstatic.com/p_h/IS23zvmlrburv11000000000.jpg",
      "agentImage": "https://www.zillowstatic.com/static/images/nophoto_h_n.png",
      "details": "NEW PRICE DROP! Located in the desirable community of Paloma Del Sol this 3 bedroom cul- de- sac home is ready for move in! The spacious master suite has a large walk in closet and dual sinks in the bathroom. The front and back yards are nicely sized perfect for entertaining. This home is walking distance to award winning schools, parks, pools, and tennis courts. Hurry now this home won't last long!"
    }
  ]